<h2>Страница посвящена &quot;Дурацкому движку&quot;, на котором работает этот сайт</h2>
<p>Исходный код представлен в <a href="https://github.com/nsedenkov/php_foolcms">GitHub</a></p>
<p>&quot;Движок&quot; обладает следующими функциями:</p>
<ul>
    <li>публикация статей</li>
    <li>иерархическая структура страниц, хранящаяся в СУБД</li>
    <li>динамическая сборка главного меню</li>
    <li>поддержка &quot;человекопонятных&quot; URL (требуется включение mod_rewrite)</li>
    <li>набор виджетов в sidebar (например, &quot;Наши друзья&quot;)</li>
    <li>обратная связь на основе технологии AJAX с отправкой уведомлений по email</li>
</ul>
